Repository: Ru5C55an/MorseFlash
Catalog: MorseFlash/*.lproj/Localizable.strings
Languages: ar, de, es, fr, it, ja, ko, ru, sv, tr, zh_hans, zh_hant

# tapToStartText
source: Press the microphone button to start recording
ar: اضغط على زر الميكروفون لبدء التسجيل
de: Drücken Sie die Mikrofontaste, um die Aufnahme zu starten
es: Presione el botón del micrófono para comenzar la grabación
fr: Appuyez sur le bouton du microphone pour commencer l'enregistrement
it: Premere il pulsante del microfono per avviare la registrazione
ja: 録音を開始するにはマイクボタンを押してください
ko: 녹음을 시작하려면 마이크 버튼을 누르세요
ru: Нажмите кнопку микрофона, чтобы начать запись
sv: Tryck på mikrofonknappen för att starta inspelningen
tr: Kaydı başlatmak için mikrofon düğmesine basın
zh_hans: 点击麦克风按钮开始录音
zh_hant: 按下麥克風按鈕開始錄音

# speakText
source: Speak...
ar: تحدث...
de: Sprechen Sie...
es: Hable...
fr: Parlez...
it: Parla...
ja: 話してください...
ko: 말씀해주세요...
ru: Говорите...
sv: Tala...
tr: Konuşun...
zh_hans: 请说...
zh_hant: 請說...

# cancelPlayingText
source: Stop playing
ar: إيقاف التشغيل
de: Wiedergabe stoppen
es: Detener reproducción
fr: Arrêter la lecture
it: Interrompi la riproduzione
ja: 再生を停止する
ko: 재생 중지
ru: Завершить воспроизведение
sv: Stoppa uppspelning
tr: Oynatmayı durdur
zh_hans: 停止播放
zh_hant: 停止播放

# startPlayingText
source: Play with flashlight
ar: تشغيل مع الكشاف
de: Mit der Taschenlampe abspielen
es: Reproducir con linterna
fr: Lecture avec la lampe torche
it: Riproduci con la torcia
ja: 懐中電灯で再生する
ko: 플래시로 재생
ru: Воспроизвести фонариком
sv: Spela upp med ficklampa
tr: Fenerle oynat
zh_hans: 用手电筒播放
zh_hant: 用手電筒播放

# noTextForPlaying
source: No encoded message
ar: لا توجد رسالة مشفرة
de: Keine codierte Nachricht
es: No hay mensaje codificado
fr: Aucun message encodé
it: Nessun messaggio codificato
ja: エンコードされたメッセージがありません
ko: 코딩된 메시지가 없습니다
ru: Нет закодированного сообщения
sv: Inget kodat meddelande
tr: Kodlanmış mesaj yok
zh_hans: 没有编码信息
zh_hant: 沒有編碼信息

# unsupportedLocale
source: Locale not supported
ar: اللغة المحلية غير معتمدة
de: Region wird nicht unterstützt
es: La ubicación no es compatible
fr: Région non prise en charge
it: Regione non supportata
ja: 地域はサポートされていません
ko: 지역이 지원되지 않습니다
ru: Локаль не поддерживается
sv: Platsen stöds inte
tr: Yer desteklenmiyor
zh_hans: 不支持该地区
zh_hant: 不支援此區域

# errorAccessCamera
source: Cannot access camera
ar: لا يمكن الوصول إلى الكاميرا
de: Kamera kann nicht zugegriffen werden
es: No se puede acceder a la cámara
fr: Impossible d'accéder à la caméra
it: Impossibile accedere alla fotocamera
ja: カメラにアクセスできません
ko: 카메라에 접근할 수 없습니다
ru: Не удается получить доступ к камере
sv: Kan inte få åtkomst till kameran
tr: Kameraya erişilemiyor
zh_hans: 无法访问相机
zh_hant: 無法訪問相機

# errorTurnOnFlashlight
source: Cannot turn on flashlight
ar: لا يمكن تشغيل الكشاف
de: Taschenlampe kann nicht eingeschaltet werden
es: No se puede encender la linterna
fr: Impossible d'allumer la lampe torche
it: Impossibile accendere la torcia
ja: 懐中電灯をオンにできません
ko: 플래시를 켤 수 없습니다
ru: Невозможно включить фонарик
sv: Kan inte slå på ficklampan
tr: Fener açılamıyor
zh_hans: 无法开启手电筒
zh_hant: 無法開啟手電筒

# errorTurnOffFlashlight
source: Cannot turn off flashlight
ar: لا يمكن إيقاف الكشاف
de: Taschenlampe kann nicht ausgeschaltet werden
es: No se puede apagar la linterna
fr: Impossible d'éteindre la lampe torche
it: Impossibile spegnere la torcia
ja: 懐中電灯をオフにできません
ko: 플래시를 끌 수 없습니다
ru: Невозможно выключить фонарик
sv: Kan inte stänga av ficklampan
tr: Fener kapatılamıyor
zh_hans: 无法关闭手电筒
zh_hant: 無法關閉手電筒

# deniedSpeechRecognition
source: Speech recognition access must be enabled in settings.
ar: يجب تمكين وصول التعرف على الصوت في الإعدادات
de: Der Zugriff auf die Spracherkennung muss in den Einstellungen aktiviert werden
es: Es necesario habilitar el acceso al reconocimiento de voz en la configuración
fr: La reconnaissance vocale doit être activée dans les paramètres
it: È necessario abilitare l'accesso al riconoscimento vocale nelle impostazioni
ja: 設定で音声認識へのアクセスを有効にする必要があります
ko: 설정에서 음성 인식 액세스를 활성화해야 합니다
ru: Необходимо включить доступ к распознаванию речи в настройках
sv: Röstigenkänning måste aktiveras i inställningarna
tr: Ayarlarda ses tanıma erişimi etkinleştirilmelidir
zh_hans: 需要在设置中启用语音识别权限
zh_hant: 需要在設置中啟用語音識別權限

# restrictedSpeechRecognition
source: Speech recognition is restricted on this device
ar: تم تقييد تعرف الكلام على هذا الجهاز
de: Spracherkennung auf diesem Gerät eingeschränkt
es: El reconocimiento de voz está restringido en este dispositivo
fr: Reconnaissance vocale limitée sur cet appareil
it: Riconoscimento vocale limitato su questo dispositivo
ja: このデバイスで音声認識が制限されています
ko: 이 장치에서 음성 인식이 제한됩니다
ru: Распознавание речи ограничено на этом устройстве
sv: Röstigenkänning är begränsad på den här enheten
tr: Bu cihazda konuşma tanıma sınırlıdır
zh_hans: 该设备上的语音识别受限
zh_hant: 此裝置上的語音識別受限

# notRecognisedSpeechRecognition
source: Speech recognition is not yet authorized
ar: لم يتم تفويض تعرف الكلام حتى الآن
de: Spracherkennung ist noch nicht autorisiert
es: El reconocimiento de voz aún no está autorizado
fr: La reconnaissance vocale n'a pas encore été autorisée
it: Il riconoscimento vocale non è ancora autorizzato
ja: 音声認識はまだ承認されていません
ko: 음성 인식이 아직 승인되지 않았습니다
ru: Распознавание речи еще не авторизовано
sv: Röstigenkänning har ännu inte godkänts
tr: Konuşma tanıma henüz yetkilendirilmedi
zh_hans: 语音识别尚未获得授权
zh_hant: 語音識別尚未獲得授權

# selectLanguage
source: First, select the desired language by clicking on the globe icon in the upper right corner of the screen
ar: اللغة
de: Sprachauswahl
es: Selección de idioma
fr: Choix de la langue
it: Scelta della lingua
ja: 言語の選択
ko: 언어 선택
ru: Выбор языка
sv: Språkval
tr: Dil Seçimi
zh_hans: 语言选择
zh_hant: 語言選擇

# needEnableAccessToSpeechRecognitionText
source: Allow access to speech recognition in settings
ar: السماح بالوصول إلى التعرف على الكلام في الإعدادات
de: Zugriff auf die Spracherkennung in den Einstellungen erlauben
es: Permitir acceso al reconocimiento de voz en la configuración
fr: Autoriser l'accès à la reconnaissance vocale dans les paramètres
it: Consenti l'accesso al riconoscimento vocale nelle impostazioni
ja: 設定で音声認識へのアクセスを許可する
ko: 설정에서 음성 인식 액세스 허용
ru: Разрешить доступ к распознаванию речи в настройках
sv: Tillåt åtkomst till röstigenkänning i inställningarna
tr: Ayarlar'da konuşma tanıma erişimine izin ver
zh_hans: 在设置中允许语音识别访问
zh_hant: 在設置中允許語音識別訪問

# insertMorseCode
source: Insert Morse code in the format "... . -..- -.-. ..-"
ar: أدخل رمز المورس في التنسيق "... . -..- -.-. ..-"
de: Fügen Sie den Morsecode im Format "... . -..- -.-. ..-" ein
es: Inserte el código Morse en el formato "... . -..- -.-. ..-"
fr: Insérez le code Morse au format "... . -..- -.-. ..-"
it: Inserisci il codice Morse nel formato "... . -..- -.-. ..-"
ja: モールス符号を「... . -..- -.-. ..-」の形式で挿入してください
ko: 모스 부호를 "... . -..- -.-. ..-" 형식으로 삽입하세요
ru: Вставьте морзе код в формате ".... . .-.. .-.. ---"
sv: Infoga morse kod i formatet "... . -..- -.-. ..-"
tr: Morse kodunu "... . -..- -.-. ..-" formatında yerleştirin
zh_hans: 将摩尔斯码以格式 "... . -..- -.-. ..-" 插入
zh_hant: 將摩爾斯碼以格式 "... . -..- -.-. ..-" 插入

source: Text in Morse code
ar: المورزي بالنص
es: Texto en código Morse
fr: Texte en code Morse
it: Testo in codice Morse
ja: モールス信号のテキスト
ko: 모스 부호로 된 텍스트
ru: Текст в Морзе
sv: Text i morsekod
tr: Mors kodlu metin
zh_hans: 摩尔斯电码文本
zh_hant: 摩爾斯電碼文本

source: Morse code to text
ar: النص بالمورزي
de: Morsecode in Text
es: Código Morse en texto
fr: Code Morse en texte
it: Codice Morse in testo
ja: モールス信号からテキストに変換
ko: 모스 부호를 텍스트로 변환
ru: Морзе в текст
sv: Morse till text
tr: Mors kodundan metne çevirme
zh_hans: 摩尔斯电码转文本
zh_hant: 摩爾斯電碼轉文本

# availableCharacters
source: It is possible to enter letters from the alphabet of the selected language, numbers and some special characters
ar: من الممكن إدخال الحروف الأبجدية للغة المختارة والأرقام وبعض الأحرف الخاصة
de: Es ist möglich, Buchstaben aus dem Alphabet der gewählten Sprache, Zahlen und einige Sonderzeichen einzugeben
es: Puede introducir letras del alfabeto del idioma seleccionado, números y algunos caracteres especiales.
fr: Vous pouvez saisir des lettres de l'alphabet de la langue sélectionnée, des chiffres et certains caractères spéciaux
ja: 選択した言語のアルファベット、数字、特殊文字を入力できます。
ko: 선택한 언어의 알파벳, 숫자 및 일부 특수 문자의 문자를 입력할 수 있습니다.
ru: Имеется возомжность вводить буквы из алфавита выбранного языка, цифры и некоторые спец символы
sv: Det är möjligt att ange bokstäver från alfabetet för det valda språket, siffror och vissa specialtecken
tr: Seçilen dilin alfabesinden harfler, sayılar ve bazı özel karakterler girebilirsiniz
zh_hans: 可以输入所选语言的字母、数字和一些特殊字符。
zh_hant: 可以輸入所選語言的字母、數字和一些特殊字符

# unavailableCharacter
source: The character "%1$@" is not available in the alphabet.
ar: الحرف "%1$@" غير متوفر في الأبجدية.
de: Das Zeichen "%1$@" ist im Alphabet nicht verfügbar.
es: El carácter "%1$@" no está disponible en el alfabeto.
fr: Le caractère "%1$@" n'est pas disponible dans l'alphabet.
ja: 文字 "%1$@" はアルファベットに存在しません。
ko: 문자 "%1$@"은(는) 알파벳에 없습니다.
ru: Символ "%1$@" отсутствует в алфавите
sv: Tecknet "%1$@" finns inte i alfabetet.
tr: Karakter "%1$@" alfabe içinde mevcut değil.
zh_hans: 字母 "%1$@" 不在字母表中。
zh_hant: 字母 "%1$@" 不在字母表中。

# needChangeLanguageInApp
source: Change the language in the app.
ar: يرجى تغيير اللغة في التطبيق.
de: Ändern Sie die Sprache in der App.
es: Cambie el idioma en la aplicación.
fr: Veuillez changer la langue dans l'application.
ja: アプリ内で言語を変更してください。
ko: 앱에서 언어를 변경하세요.
ru: Смените язык в приложении
sv: Ändra språket i appen.
tr: Dili uygulamada değiştirin.
zh_hans: 请在应用程序中更改语言。
zh_hant: 請在應用程序中更改語言。
